var SUBGLYPH_DEFAULTS = {
  a: {
    '@': 5,
    '^': 3,
    'ā': 9,
    'ă': 9,
    'ą': 8,
    'ȁ': 9,
    'ȃ': 9,
    'à': 9,
    'á': 9,
    'â': 9,
    'ã': 9,
    'ä': 9,
    'å': 9,
    'æ': 6,
    'ª': 7
  },
  A: {
    "^": 6,
    "@": 3,
    "À": 9,
    "Á": 9,
    "Â": 9,
    "Ã": 9,
    "Ä": 9,
    "Å": 9,
    "Æ": 6,
    "Ą": 9,
    "Ȁ": 9,
    "ѩ": 5,
    "Ā": 9,
    "Ă": 9,
    "Ѧ": 8,
    "ѧ": 8,
    "Ѩ": 4
  },
  b: {
    'Þ': 6,
    'þ': 6,
    'ƀ': 7,
    'Ƃ': 6,
    'ƃ': 6,
    'Ƅ': 9,
    'ƅ': 9
  },
  B: {
    'ß': 7,
    'Ɓ': 8
  },
  c: {
    'ƈ': 8,
    'ć': 9,
    'ĉ': 9,
    'ċ': 8,
    'č': 9,
    '¢': 7,
    'ç': 7,
    '©': 6
  },
  C: {
    'Ć': 9,
    'Ĉ': 9,
    'Ċ': 9,
    'Č': 9,
    'Ç': 9,
    'Ɔ': 6,
    'Ƈ': 8,
    '©': 6,
    'Ͻ': 6,
    'Ͼ': 8,
    'Ͽ': 5
  },
// rescore
  d: {
    'đ': 9,
    'ď': 9,
    'Ƌ': 9,
    'ƌ': 9,
    'Ə': 9
  },
  D: {
    'Ð': 9,
    'Ď': 9,
    'Ɔ': 9,
    'Ɖ': 9,
    'Ɗ': 9,
    'Ͽ': 9,
    'ƿ': 9
  },
  e: {
    'ē': 9,
    'ĕ': 9,
    'ȅ': 9,
    'ȇ': 9,
    'ė': 9,
    'ę': 9,
    'ě': 9,
    'è': 9,
    'é': 9,
    'ê': 9,
    'ë': 9
  },
  E: {
    'Ȅ': 9,
    'Ȇ': 9,
    'Ѐ': 9,
    'Ё': 9,
    'Є': 9,
    'Ē': 9,
    'Ĕ': 9,
    'Ė': 9,
    'Ę': 9,
    'Ě': 9,
    'Ǝ': 9,
    'Ɛ': 9,
    'ƹ': 9,
    'Ʃ': 9,
    'Ƹ': 9
  },
  f: {
    'ſ': 9,
    'ƒ': 9,
    'ƭ': 9
  },
  F: {
    'Ƒ': 9
  },
  g: {
    'ġ': 9,
    'ģ': 9,
    'ĝ': 9,
    'ğ': 9,
    'ƍ': 9
  },
  G: {
    'Ġ': 9,
    'Ģ': 9,
    'Ĝ': 9,
    'Ğ': 9,
    'Ɠ': 9
  },
  h: {
    'ħ': 9,
    'ĥ': 9,
    'Ђ': 9,
    'ȟ': 9,
    'ƕ': 9
  },
  H: {
    'Ĥ': 9,
    'Ħ': 9,
    'Ȟ': 9
  },
  i: {
    'ȉ': 9,
    'ȋ': 9,
    'ĳ': 9,
    'ı': 9,
    'ĩ': 9,
    'ī': 9,
    'ĭ': 9,
    'į': 9,
    'ì': 9,
    'í': 9,
    'î': 9,
    'ï': 9
  },
  I: {
    'Ȉ': 9,
    'Ȋ': 9,
    'І': 9,
    'Ї': 9,
    'İ': 9,
    'Ĳ': 9,
    'Ĩ': 9,
    'Ī': 9,
    'Ĭ': 9,
    'Į': 9,
    'ƪ': 9,
    '¦': 9,
    'Ɨ': 9
  },
  j: {
    'ĵ': 9,
    'ĳ': 2
  },
  J: {
    'Ј': 9,
    'Ĵ': 9
  },
  k: {
    'Ķ': 9,
    'Ƙ': 9
  },
  K: {
    'ƙ': 9,
    'ķ': 9,
    'ĸ': 9
  },
  l: {
    'ľ': 9,
    'ļ': 9,
    'ĺ': 9,
    'ŀ': 9,
    'ł': 9,
    '¦': 9
  },
  L: {
    'Ł': 9,
    'Ĺ': 9,
    'Ļ': 9,
    'Ľ': 9,
    'Ŀ': 9,
    '£': 9,
    'ƪ': 9
  },
  m: {
    'ɱ': 9,
    'ʍ': 9,
    'Ϻ': 9,
    'ϻ': 9,
    'Ԡ': 7,
    'ԡ': 7
  },
  M: {
    'ϻ': 9,
    'ʍ': 9,
    'Ϻ': 9,
    'Ѫ': 9,
    'ѫ': 9,
    'Ѭ': 9,
    'ѭ': 9,
    'Ԡ': 7,
    'ԡ': 7
  },
  n: {
    'ƞ': 9,
    'ŋ': 9,
    'ň': 9,
    'ŉ': 9,
    'ņ': 9,
    'ń': 9,
    'ñ': 9,
    'ɲ': 9,
    'ɳ': 9
  },
  N: {
    'Ñ': 9,
    'Ń': 9,
    'Ņ': 9,
    'Ň': 9,
    'Ŋ': 9,
    'Ɲ': 9
  },
  o: {
    'ơ': 9,
    'ő': 9,
    'œ': 9,
    'ŏ': 9,
    'ō': 9,
    'ð': 9,
    'ò': 9,
    'ó': 9,
    'ô': 9,
    'õ': 9,
    'ö': 9,
    'ơ': 9
  },
  O: {
    'Ɵ': 9,
    'Ō': 9,
    'Ŏ': 9,
    'Ő': 9,
    'Œ': 9,
    'Ò': 9,
    'Ó': 9,
    'Ô': 9,
    'Õ': 9,
    'Ö': 9,
    'Ø': 9,
    'Ơ': 9,
    'Ơ': 9
  },
  p: {
    'ƥ': 9,
    'Þ': 9,
    'þ': 9,
    'ƿ': 9
  },
  P: {
    'Ƥ': 9,
    'ƿ': 9
  },
  q: {
    'ƍ': 9,
    'ϼ': 9
  },
  Q: {
    'Ƣ': 9,
    'ƍ': 9
  },
  r: {
    '®': 9,
    'ř': 9,
    'ŗ': 9,
    'ŕ': 9
  },
  R: {
    'Ŕ': 9,
    'Ŗ': 9,
    'Ř': 9,
    '®': 9,
    'Ʀ': 9,
    'Я': 8
  },
  s: {
    'ƨ': 9,
    'ş': 9,
    'ŝ': 9,
    'ś': 9,
    'š': 9,
    'ϟ': 7
  },
  S: {
    'Ƽ': 9,
    'Š': 9,
    'Ś': 9,
    'Ŝ': 9,
    'Ş': 9,
    '§': 9,
    'ƽ': 9,
    'Ƨ': 9
  },
  t: {
    'ŧ': 9,
    'ţ': 9,
    'ť': 9,
    'ƭ': 9,
    'ƫ': 9,
    'ƪ': 9
  },
  T: {
    'Ƭ': 9,
    'Ţ': 9,
    'Ť': 9,
    'Ŧ': 9,
    'Ʈ': 9
  },
  u: {
    'ù': 9,
    'ú': 9,
    'û': 9,
    'ü': 9,
    'ũ': 9,
    'ū': 9,
    'ŭ': 9,
    'ů': 9,
    'ű': 9,
    'ų': 9,
    'µ': 9,
    'ư': 9
  },
  U: {
    'Ũ': 9,
    'Ū': 9,
    'Ŭ': 9,
    'Ů': 9,
    'Ű': 9,
    'Ų': 9,
    'Ù': 9,
    'Ú': 9,
    'Û': 9,
    'Ü': 9,
    'Ư': 9
  },
  v: {
    'Ʊ': 9,
    'Ʋ': 9
  },
  V: {
    'Ʊ': 9,
    'Ʋ': 9
  },
  w: {
    'ŵ': 9
  },
  W: {
    'Ŵ': 9,
    'Ɯ': 9
  },
  x: {
    '': 9,
    '×': 9,
    'Ɣ': 9
  },
  X: {
    '': 9,
    '×': 9,
    'Ɣ': 9
  },
  y: {
    'Ɣ': 9,
    'ŷ': 9,
    'ý': 9,
    'ÿ': 9,
    'ƴ': 9,
    'ƛ': 9
  },
  Y: {
    'Ŷ': 9,
    'Ÿ': 9,
    'Ý': 9,
    '¥': 9,
    'Ƴ': 9
  },
  z: {
    'ƶ': 9,
    'ž': 9,
    'ź': 9,
    'ż': 9
  },
  Z: {
    'Ź': 9,
    'Ż': 9,
    'Ž': 9,
    'Ƶ': 9
  },
  0: {
    'Ɵ': 9,
    'O': 9,
    'o': 9
  },
  1: {
    '|': 9,
    'l': 9,
    'ǀ': 9,
    'ǁ': 9,
    'ǃ': 9
  },
  2: {
    'ƻ': 9,
    'Ƨ': 9,
    'ƨ': 9
  },
  3: {
    'Ƹ': 9,
    'ƹ': 9,
    'ƺ': 9,
    'ƾ': 9,
    'Ȝ': 9,
    'ȝ': 9
  },
  4: {

  },
  5: {
    'Ƽ': 9,
    'ƽ': 9
  },
  6: {
    'ɓ': 7
  },
  7: {
    '>': 6
  },
  8: {

  },
  9: {

  }
};

// Woops, i guess i haven't talked to a
//   real javascript programmer in the 3 years
//   i've lived in Roanoke MY BAD. I also haven't
//   talked to a single person that uses Emacs.
//module.exports.Subglyph = SG;

//Ǆ: 9,
//ǅ: 9,
//ǆ: 9,
//Ǉ: 9,
//ǈ: 9,
//ǉ: 9,
//Ǌ: 9,
//ǋ: 9,
//ǌ: 9,
//
//Ǎ: 9,
//ǎ: 9,
//Ǐ: 9,
//
//ǐ: 9,
//Ǒ: 9,
//ǒ: 9,
//Ǔ: 9,
//ǔ: 9,
//Ǖ: 9,
//ǖ: 9,
//Ǘ: 9,
//ǘ: 9,
//Ǚ: 9,
//ǚ: 9,
//Ǜ: 9,
//ǜ: 9,
//ǝ: 9,
//Ǟ: 9,
//ǟ: 9,
//
//Ǡ: 9,
//ǡ: 9,
//Ǣ: 9,
//ǣ: 9,
//Ǥ: 9,
//ǥ: 9,
//Ǧ: 9,
//ǧ: 9,
//Ǩ: 9,
//ǩ: 9,
//Ǫ: 9,
//ǫ: 9,
//Ǭ: 9,
//ǭ: 9,
//Ǯ: 9,
//ǯ: 9,
//
//ǰ: 9,
//Ǳ: 9,
//ǲ: 9,
//ǳ: 9,
//Ǵ: 9,
//ǵ: 9,
//Ƕ: 9,
//Ƿ: 9,
//Ǹ: 9,
//ǹ: 9,
//Ǻ: 9,
//ǻ: 9,
//Ǽ: 9,
//ǽ: 9,
//Ǿ: 9,
//ǿ: 9,
//
//Ȍ: 9,
//ȍ: 9,
//Ȏ: 9,
//ȏ: 9,
//
//Ȑ: 9,
//ȑ: 9,
//Ȓ: 9,
//ȓ: 9,
//Ȕ: 9,
//ȕ: 9,
//Ȗ: 9,
//ȗ: 9,
//Ș: 9,
//ș: 9,
//Ț: 9,
//ț: 9,

//Ƞ: 9,
//ȡ: 9,
//Ȣ: 9,
//ȣ: 9,
//Ȥ: 9,
//ȥ: 9,
//Ȧ: 9,
//ȧ: 9,
//Ȩ: 9,
//ȩ: 9,
//Ȫ: 9,
//ȫ: 9,
//Ȭ: 9,
//ȭ: 9,
//Ȯ: 9,
//ȯ: 9,

//ȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿ
//ɀɁɂɃɄɅɆɇɈɉɊɋɌɍɎɏ
//ɐɑɒɔɕɖɗɘəɚɛɜɝɞɟ
//ɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯ
//ɰɴɵɶɷɸɹɺɻɼɽɾɿ
//ʀʁʂʃʄʅʆʇʈʉʊʋʌʎʏ
//ʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟ
//ʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯ

//////

//ʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿ
//ˀˁ˂˃˄˅ˆˇˈˉˊˋˌˍˎˏ
//ːˑ˒˓˔˕˖˗˘˙˚˛˜˝˞˟
//ˠˡˢˣˤ˥˦˧˨˩˪˫ˬ˭ˮ˯
//˰˱˲˳˴˵˶˷˸˹˺˻˼˽˾˿
//̀́̂̃̄̅̆̇̈̉̊̋̌̍̎̏
//̛̖̗̘̙̜̝̞̟̐̑̒̓̔̕̚
//̡̢̧̨̠̣̤̥̦̩̪̫̬̭̮̯
//̴̵̶̷̸̰̱̲̳̹̺̻̼̽̾̿
//͇͈͉͍͎̀́͂̓̈́͆͊͋͌ͅ͏
//͓͔͕͖͙͚͐͑͒͗͛͘͜͟͝͞
//ͣͤͥͦͧͨͩͪͫͬͭͮͯ͢͠͡
//ͰͱͲͳʹ͵Ͷͷ͸͹ͺͻͼͽ;Ϳ
//΀΁΂΃΄΅Ά·ΈΉΊ΋Ό΍ΎΏ
//ΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟ
//ΠΡ΢ΣΤΥΦΧΨΩΪΫάέήί
//ΰαβγδεζηθικλμνξο
//πρςστυφχψωϊϋόύώϏ
//ϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞ
//ϠϡϢϣϤϥϦϧϨϩϪϫϬϭϮϯ
//ϰϱϲϳϴϵ϶ϷϸϹ
////ЃЅЉЊЋЌЍЎЏ
//АБВГДЕЖЗИЙКЛМНОП
//РСТУФХЦЧШЩЪЫЬЭЮ
//абвгдежзийклмноп
//рстуфхцчшщъыьэюя
//ѐёђѓєѕіїјљњћќѝўџ
//ѠѡѢѣѤѥѮѯ
//ѰѱѲѳѴѵѶѷѸѹѺѻѼѽѾѿ
//Ҁҁ҂҃҄҅҆҇҈҉ҊҋҌҍҎҏ
//ҐґҒғҔҕҖҗҘҙҚқҜҝҞҟ
//ҠҡҢңҤҥҦҧҨҩҪҫҬҭҮү
//ҰұҲҳҴҵҶҷҸҹҺһҼҽҾҿ
//ӀӁӂӃӄӅӆӇӈӉӊӋӌӍӎӏ
//ӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟ
//ӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯ
//ӰӱӲӳӴӵӶӷӸӹӺӻӼӽӾӿ
//ԀԁԂԃԄԅԆԇԈԉԊԋԌԍԎԏ
//ԐԑԒԓԔԕԖԗԘԙԚԛԜԝԞԟ
//ԢԣԤԥԦԧԨԩԪԫԬԭԮԯ
//԰ԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿ
//ՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏ
//ՐՑՒՓՔՕՖ՗՘ՙ՚՛՜՝՞՟
//ՠաբգդեզէըթժիլխծկ
//հձղճմյնշոչպջռսվտ
//րցւփքօֆևֈ։֊֋֌֍֎֏
//֐֑֖֛֚֒֓֔֕֗֘֙֜֝֞֟
//֢֣֤֥֦֧֪֭֮֠֡֨֩֫֬֯
//ְֱֲֳִֵֶַָֹֺֻּֽ־ֿ
//׀ׁׂ׃ׅׄ׆ׇ׈׉׊׋׌׍׎׏
//אבגדהוזחטיךכלםמן
//נסעףפץצקרשת׫׬׭׮ׯ
//װױײ׳״׵׶׷׸׹׺׻׼׽׾׿
//
//
//
